package com.kjy;

public class MainClass {
	public static void main(String[] args) {
		
		String test="임재,20190509,20190510,8,남,30대후반";
		String[] split=test.split(",");
		/*
		String date1=split[1];
		System.out.println(date1);
		//20190509 => "20190509"
		//String.substring(startIndex, endIndex): ~에서 ~까지
		//String.substring(startIndex): ~에서 마지막까지
		
		String year=date1.substring(0,4);
		System.out.println(year);
		//시작부터 끝까지.
		String month=date1.substring(4,6);
		System.out.println(month);
		//시작 index값만 적으면 끝까지 감
		String day=date1.substring(6);
		System.out.println(day);
		*/
		
		/*	String name       	이름
			String joinDate   	가입일
			String lastVisitDate  최종방문일
			int numVisit	방문횟수
			String gender         성별
			int age         	연령대
		 * */
		String name=split[0];
		int age=Integer.parseInt(split[5].substring(0,2)); //<="30대후반"=>>"30" //이자식은 문자열이라 강제변환 불가능
		/*float f1=3.145f;
		int n1=(int)f1; //같은 숫자형일 때는 int로 강제변환 가능*/
		
		/*
		new EMPClass(); //저장은 안됨
		EMPClass emp1=new EMPClass(); //EMPClass가 데이터타입 //new EMPClass는 계속 새롭게 찍어내는 것 //변수명은 새롭게 찍어낸것을 나누는 것
		
		//Object emp2=new EMPClass(); //Object 라는 부모class로부터 받을 수 있음
		//Object로 선언 시 EMPClass의 변수 리스트가 안 나옴
		//부모는 아들의 자산을 모름이라고 떠올리면 될듯
		EMPClass emp2=new EMPClass();
		emp1.name="test";
		emp2.name="sample";
		
		System.out.println(emp1.name);
		System.out.println(emp2.name);
		*/
		//"임재,20190509,20190510,8,남,30대후반";
		/*
		emp1.name="임재";
		emp1.joinDate="20190509";
		emp1.lastVisitDate="20190510";
		emp1.numVisit=Integer.parseInt("8");
		emp1.gender="남";
		emp1.age=Integer.parseInt("30대후반".substring(0,2)); */
		//"성열,20190509,20190510,1,남,30대중반";
		/*
		emp2.name="성열";
		emp2.joinDate="20190509";
		emp2.lastVisitDate="20190510";
		emp2.numVisit=Integer.parseInt("1");
		emp2.gender="남";
		emp2.age=Integer.parseInt("30대중반".substring(0,2));*/
		//불편하니까 처음 생성할 때 생성자 안에 문자열을 넣어 한번에 하면 어떻겠느냐
		String[] member=new String[98];

		member[0]="임재,20190509,20190510,8,남,30대후반";
		member[1]="성열,20190509,20190510,1,남,30대중반";
		member[2]="천재,20190509,20190510,3,남,30대초반";
		member[3]="현수,20190509,20190509,1,남,20대후반";
		member[4]="진우,20190509,20190510,2,남,30대초반";
		member[5]="영주,20190509,20190510,2,비공개,비공개";
		member[6]="종화,20190509,20190509,0,남,20대후반";
		member[7]="윤정,20190509,20190510,3,비공개,비공개";
		member[8]="종호,20190509,20190510,3,남,20대중반";
		member[9]="동현,20190509,20190510,5,남,20대중반";
		member[10]="경래,20190509,20190510,1,남,20대후반";
		member[11]="상일,20190509,20190510,6,남,30대후반";
		member[12]="재형,20190509,20190510,2,남,30대중반";
		member[13]="경민,20190509,20190510,4,남,20대중반";
		member[14]="경애,20190507,20190507,0,비공개,비공개";
		member[15]="동현,20190507,20190507,0,남,40대초반";
		member[16]="종인,20190507,20190507,0,남,40대중반";
		member[17]="은혁,20190426,20190504,3,남,30대후반";
		member[18]="은정,20190426,20190426,1,여,30대중반";
		member[19]="정은,20190426,20190426,0,여,40대후반";
		member[20]="진수,20190426,20190426,1,비공개,비공개";
		member[21]="은석,20190426,20190504,2,남,50대초반";
		member[22]="수진,20190426,20190426,0,여,30대초반";
		member[23]="비공개,20190426,20190426,1,비공개,비공개";
		member[24]="재희,20190426,20190426,2,여,40대후반";
		member[25]="의환,20190426,20190426,1,남,20대후반";
		member[26]="관현,20190425,20190425,0,남,40대초반";
		member[27]="성욱,20190425,20190426,3,남,30대후반";
		member[28]="의열,20190425,20190426,5,여,30대후반";
		member[29]="가영,20190425,20190426,1,여,30대중반";
		member[30]="현수,20190425,20190505,5,남,40대초반";
		member[31]="기대,20190425,20190426,2,남,40대중반";
		member[32]="근준,20190425,20190425,0,남,20대후반";
		member[33]="성준,20190425,20190426,3,남,20대후반";
		member[34]="종오,20190425,20190426,3,남,50대중반";
		member[35]="병욱,20190425,20190426,5,남,30대초반";
		member[36]="서경,20190425,20190426,2,여,30대후반";
		member[37]="비공개,20190425,20190426,1,비공개,비공개";
		member[38]="관순,20190425,20190426,3,여,30대초반";
		member[39]="충현,20190425,20190426,1,남,30대초반";
		member[40]="시형,20190425,20190426,1,남,30대후반";
		member[41]="정윤,20190425,20190426,3,여,30대중반";
		member[42]="호섭,20190425,20190426,1,남,40대후반";
		member[43]="상민,20190425,20190426,1,남,30대중반";
		member[44]="수영,20190425,20190426,1,여,30대중반";
		member[45]="경훈,20190425,20190426,1,비공개,비공개";
		member[46]="남현,20190218,20190510,10,남,30대후반";
		member[47]="두근,20190218,20190218,0,남,20대중반";
		member[48]="윤정,20181022,20190114,18,여,20대후반";
		member[49]="현민,20181022,20190115,31,남,20대후반";
		member[50]="철우,20181011,20181024,7,남,30대초반";
		member[51]="동주,20181011,20190324,75,남,20대후반";
		member[52]="승민,20181002,20181208,48,남,20대중반";
		member[53]="근학,20180927,20190129,45,남,20대후반";
		member[54]="수민,20180927,20190412,50,남,20대후반";
		member[55]="형석,20180927,20190418,7,남,20대후반";
		member[56]="명재,20180927,20190118,41,남,30대초반";
		member[57]="병호,20180927,20181008,3,남,50대초반";
		member[58]="민태,20180927,20190208,49,남,20대중반";
		member[59]="신혜,20180927,20190120,49,여,20대후반";
		member[60]="성권,20180927,20180928,5,남,20대후반";
		member[61]="영봉,20180927,20181217,45,남,20대후반";
		member[62]="성구,20180927,20190123,47,남,20대후반";
		member[63]="부욱,20180927,20181119,24,남,30대초반";
		member[64]="주현,20180712,20180712,2,여,20대초반";
		member[65]="다희,20180626,20180626,1,여,20대중반";
		member[66]="다을,20180625,20180807,40,여,20대중반";
		member[67]="대희,20180625,20181217,57,남,20대중반";
		member[68]="자훈,20180625,20190305,47,여,20대중반";
		member[69]="지원,20180625,20180727,38,여,20대중반";
		member[70]="재학,20180625,20181101,45,남,20대중반";
		member[71]="지혜,20180625,20190410,89,여,20대중반";
		member[72]="중훈,20180625,20180727,31,남,20대중반";
		member[73]="한솔,20180625,20181205,62,여,20대중반";
		member[74]="예림,20180625,20181227,28,여,20대중반";
		member[75]="수현,20180625,20190210,17,여,20대중반";
		member[76]="소현,20180625,20180727,63,여,20대중반";
		member[77]="해성,20180625,20180726,38,남,20대후반";
		member[78]="진안,20180625,20180727,45,남,20대후반";
		member[79]="지원,20180625,20180726,17,여,20대초반";
		member[80]="경희,20180625,20190424,27,여,20대중반";
		member[81]="도형,20180625,20190504,72,남,20대후반";
		member[82]="태수,20180625,20180808,70,남,20대중반";
		member[83]="가은,20180625,20180807,42,여,20대중반";
		member[84]="힘찬,20180625,20180727,33,남,20대중반";
		member[85]="상협,20180625,20181025,43,남,20대중반";
		member[86]="용선,20180625,20190102,66,남,20대중반";
		member[87]="승현,20180625,20181206,50,남,20대중반";
		member[88]="지원,20180625,20180723,16,여,20대중반";
		member[89]="한진,20180419,20180719,47,남,20대후반";
		member[90]="유찬,20180419,20181017,71,남,20대후반";
		member[91]="기태,20180419,20180813,39,남,20대후반";
		member[92]="지훈,20180419,20190209,34,남,20대후반";
		member[93]="봉기,20180419,20181002,71,남,20대후반";
		member[94]="정규,20180419,20180627,39,남,20대초반";
		member[95]="상준,20180419,20181228,95,남,20대후반";
		member[96]="유림,20180419,20180701,53,여,20대후반";
		member[97]="소영,20180419,20180615,44,여,20대후반";
		EMPClass[] emp=new EMPClass[member.length];
		int count=member.length;
		//	0			1			2
//			EMPClass	EMPClass	EMPClass 
		/*
		 *	name		name		name
		 * 
		 * */
		for(int idx=0;idx<count;idx++) {
			emp[idx]=new EMPClass(member[idx]); //98보다 적으면 배열이 null하기 때문에 split을 못해서 에러
		}
		int maleCount=0;
		int femaleCount=0;
		for(int idx=0;idx<count;idx++) {
			if(emp[idx].gender.equals("남")) {
				maleCount+=1;
			}
			else if (emp[idx].gender.equals("여")){
				femaleCount+=1;
			}
		}
		float[] mfPortion=EMPClass.getPortion(maleCount,femaleCount,count);
		System.out.println("남자 비율: "+mfPortion[0]+"\n여자 비율: "+mfPortion[1]);
		

	}// Main END
	
}// Class END


